In [1]:
# setting
import pandas as pd
from pandasql import sqldf
data = pd.read_csv('./data.csv')

#### 특정 컬럼의 값 살펴보기

In [2]:
# pandas
data['rating']

0       PG-13
1       TV-MA
2       TV-MA
3       TV-MA
4       TV-MA
        ...
8802        R
8803    TV-Y7
8804        R
8805       PG
8806    TV-14
Name: rating, Length: 8807, dtype: object

In [3]:
# SQL
query = \
'''
SELECT rating FROM data
'''
sqldf(query)

     rating
0     PG-13
1     TV-MA
2     TV-MA
3     TV-MA
4     TV-MA
...     ...
8802      R
8803  TV-Y7
8804      R
8805     PG
8806  TV-14

[8807 rows x 1 columns]

#### 특정 컬럼의 자료형 살펴보기

In [4]:
# pandas
data['rating'].dtype

dtype('O')

In [5]:
# SQL
query = \
'''
SELECT typeof(rating) as rating_dtype 
FROM data 
LIMIT 1
'''
sqldf(query)

  rating_dtype
0         text

#### 특정 컬럼에 존재하는 독립된 값들 파악하기

In [6]:
# pandas
data['rating'].unique()

array(['PG-13', 'TV-MA', 'PG', 'TV-14', 'TV-PG', 'TV-Y', 'TV-Y7', 'R',
       'TV-G', 'G', 'NC-17', '74 min', '84 min', '66 min', 'NR', nan,
       'TV-Y7-FV', 'UR'], dtype=object)

In [7]:
# SQL
query = \
'''
SELECT rating as rating_unique 
FROM data 
GROUP BY rating
'''
sqldf(query)

   rating_unique
0           None
1         66 min
2         74 min
3         84 min
4              G
5          NC-17
6             NR
7             PG
8          PG-13
9              R
10         TV-14
11          TV-G
12         TV-MA
13         TV-PG
14          TV-Y
15         TV-Y7
16      TV-Y7-FV
17            UR

#### 특정 컬럼에 존재하는 독립된 값들의 유형 파악하기

In [8]:
# pandas
data['rating'].nunique()

17

In [9]:
# SQL
query = \
'''
SELECT COUNT(DISTINCT rating) as rating_nunique 
FROM data
'''
sqldf(query)

   rating_nunique
0              17

#### 특정 컬럼에 존재하는 독립된 값들 각각의 개수 파악하기

In [10]:
# pandas 
data['rating'].value_counts()

TV-MA       3207
TV-14       2160
TV-PG        863
R            799
PG-13        490
TV-Y7        334
TV-Y         307
PG           287
TV-G         220
NR            80
G             41
TV-Y7-FV       6
NC-17          3
UR             3
74 min         1
84 min         1
66 min         1
Name: rating, dtype: int64

In [11]:
# SQL
query = \
'''
SELECT rating, COUNT(*) as count 
FROM data 
GROUP BY rating
ORDER BY count DESC
'''
sqldf(query)

      rating  count
0      TV-MA   3207
1      TV-14   2160
2      TV-PG    863
3          R    799
4      PG-13    490
5      TV-Y7    334
6       TV-Y    307
7         PG    287
8       TV-G    220
9         NR     80
10         G     41
11  TV-Y7-FV      6
12      None      4
13        UR      3
14     NC-17      3
15    84 min      1
16    74 min      1
17    66 min      1

#### 특정 컬럼에 존재하는 독립된 값들 각각의 비율 파악하기

In [12]:
# pandas
data['rating'].value_counts(normalize=True)

TV-MA       0.364308
TV-14       0.245371
TV-PG       0.098035
R           0.090765
PG-13       0.055663
TV-Y7       0.037942
TV-Y        0.034874
PG          0.032603
TV-G        0.024991
NR          0.009088
G           0.004658
TV-Y7-FV    0.000682
NC-17       0.000341
UR          0.000341
74 min      0.000114
84 min      0.000114
66 min      0.000114
Name: rating, dtype: float64

In [13]:
# SQL
# COUNT(*)에 1.0을 곱하여 소수점 표현
query = \
'''
SELECT rating, 
       COUNT(*) * 1.0 / (SELECT COUNT(*) FROM data) as percentage
FROM data 
GROUP BY rating
ORDER BY percentage DESC
'''
sqldf(query)

      rating  percentage
0      TV-MA    0.364142
1      TV-14    0.245259
2      TV-PG    0.097990
3          R    0.090723
4      PG-13    0.055638
5      TV-Y7    0.037924
6       TV-Y    0.034859
7         PG    0.032588
8       TV-G    0.024980
9         NR    0.009084
10         G    0.004655
11  TV-Y7-FV    0.000681
12      None    0.000454
13        UR    0.000341
14     NC-17    0.000341
15    84 min    0.000114
16    74 min    0.000114
17    66 min    0.000114